cool/tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/constant/limestoneCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      limestoneCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

active          true;

InjectionModel  ManualInjection;

DragModel       SphereDrag;

DispersionModel StochasticDispersionRAS;

PatchInteractionModel StandardWallInteraction;

HeatTransferModel RanzMarshall;

PostProcessingModel none;

radiation       on;

coupled         true;

cellValueSourceCorrection on;

parcelTypeId    2;

constantProperties
{
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 1e-15;
    TMin            TMin [ 0 0 0 1 0 ] 200;
    minParticleMass minParticleMass [ 1 0 0 0 0 ] 1e-15;
    rho0            rho0 [ 1 -3 0 0 0 ] 2500;
    T0              T0 [ 0 0 0 1 0 ] 300;
    cp0             cp0 [ 0 2 -2 -1 0 ] 900;
    epsilon0        epsilon0 [ 0 0 0 0 0 ] 1;
    f0              f0 [ 0 0 0 0 0 ] 0.5;
    Pr              Pr [ 0 0 0 0 0 ] 0.7;
}

interpolationSchemes
{
    rho             cell;
    mu              cell;
    U               cellPoint;
    Cp              cell;
    T               cell;
}

integrationSchemes
{
    U               Euler;
    T               Analytical;
}

particleForces
{
    gravity         on;
    virtualMass     off;
    pressureGradient off;
}

ManualInjectionCoeffs
{
    massTotal       massTotal [ 1 0 0 0 0 ] 0.0001;
    parcelBasisType mass;
    SOI             0;
    positionsFile   "limestonePositions";
    U0              ( 0 0 0 );
    parcelPDF
    {
        pdfType         RosinRammler;
        RosinRammlerPDF
        {
            minValue        5e-06;
            maxValue        0.000565;
            d               ( 4.8e-05 );
            n               ( 0.5 );
        }
    }
}

StandardWallInteractionCoeffs
{
    type            rebound;
    e               1; // optional
    mu              0; // optional
}

RanzMarshallCoeffs
{
    // thermal shielding
    BirdCorrection  false;
}

// ************************************************************************* //
